In [ ]:
#STEVEN ZAJAC-DESCÔTEAUX

In [64]:
import numpy as np
import pandas as pd

# Notes:

You are banned from using loops (`for` or `while` or any other) for this entire workshop!

You shouldn't be using loops almost ever with pandas in any case, so break out of the habit now.

## 1. DataFrame basics


Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**1.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

**2.** Select only the rows where visits are 3 or more. Which types of animals are these?

**3.** Select the rows where visists are 3 and the animal is a cat

**4.** Calculate the sum of all visits in `df` (i.e. the total number of visits).

**5.** Calculate the mean age for each different animal in `df`.

**6.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [8]:
#1. Create a DataFrame df from this dictionary data which has the index labels.

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data)
df.index = labels
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [30]:
#2. Select only the rows where visits are 3 or more. Which types of animals are these?
df_visits = df.loc[df.visits >= 3]
animal = df_visits['animal']
animal.tolist()

['cat', 'dog', 'cat']

In [48]:
#3. Select the rows where visists are 3 and the animal is a cat
df_visits.loc[df_visits.animal=='cat']

  animal  age  visits priority
b    cat  3.0       3      yes
f    cat  2.0       3       no

In [61]:
#4. Calculate the sum of all visits in df (i.e. the total number of visits)
df['visits'].sum()

19

In [65]:
#5. Calculate the mean age for each different animal in df
df.groupby('animal')['age'].mean()

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64

In [69]:
#6. Append a new row 'k' to df with your choice of values for each column.
# Then delete that row to return the original DataFrame.
df['k'] = range(len(df))
df

  animal  age  visits priority  k
a    cat  2.5       1      yes  0
b    cat  3.0       3      yes  1
c  snake  0.5       2       no  2
d    dog  NaN       3      yes  3
e    dog  5.0       2       no  4
f    cat  2.0       3       no  5
g  snake  4.5       1       no  6
h    cat  NaN       1      yes  7
i    dog  7.0       2       no  8
j    dog  3.0       1       no  9

In [71]:
df.drop('k', axis=1) #axis 1 because column, 0 is row
#del df['k'] #also worked

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

# 2.1 Shifty problem

You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

```python
1, 2, 3, 4, 5, 6, 7
```

### Hint: use the `shift()` method

In [217]:
# Removes duplicates but only if they're in order. 
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.drop_duplicates().style.hide_index()

In [269]:
#Filters out rows which contain the same integer as row immediately above (order unimportant)
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.loc[df['A'].shift() != df['A']].style.hide_index()

# 2.2 columns sum min

Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? Return that column's label.

In [2]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df.sum().idxmin()

'd'

# 2.3 Duplicates

How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

**hint:** There's a method for to find duplicate rows for you

In [27]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df.nunique()

A    7
dtype: int64

In [25]:
#verification
df.drop_duplicates().count()

A    7
dtype: int64

In [26]:
df.duplicated().value_counts()

False    7
True     4
dtype: int64

# 2.4 Group Values

A DataFrame has a column of groups 'grps' and and column of integer values 'vals': 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values.  You should end up with the answer as follows:
```
grps
a    409
b    156
c    345
```

In [326]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})


df.groupby('grps')['vals'].nlargest(3).sum(level=0)

#nlargest(3): looks at 3 greatest values
#sum(level=0): to go down columns rather than across

grps
a    409
b    156
c    345
Name: vals, dtype: int64

# 3. Cleaning Data

### Making a DataFrame easier to work with

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

Formatted, it looks like this:

```
            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"
```

**1.** Some values in the the **FlightNumber** column are missing (they are `NaN`). These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Modify `df` to fill in these missing numbers and make the column an integer column (instead of a float column).

In [546]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [547]:
df = df.interpolate()
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 3.2 column splitting

The **From\_To** column would be better as two separate columns! Split each string on the underscore delimiter `_` to make two new columns `From` and `To` to your dataframe.

In [548]:
df[['From','To']] = df.From_To.str.split("_",expand=True,)
df.drop('From_To', inplace=True, axis=1) #str.split() w/ expand=True results in a DataFrame. Else would get series
cols = df.columns.tolist()
cols.insert(0, cols.pop(cols.index('From'))) #insert and pop to move colums around
cols.insert(1,cols.pop(cols.index('To')))
df = df.reindex(columns=cols)
df

       From         To  FlightNumber  RecentDelays              Airline
0    LoNDon      paris       10045.0      [23, 47]               KLM(!)
1    MAdrid      miLAN       10055.0            []    <Air France> (12)
2    londON  StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis       10075.0          [13]       12. Air France
4  Brussels     londOn       10085.0      [67, 32]          "Swiss Air"

# 3.3 Clean Text

Make the text in your dataframe:

- From and To columns should be lowercase with only first letter capitalized

- In the **Airline** column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [550]:
df['From'] = df['From'].str.title()
df['To'] = df['To'].str.title()
df['Airline'] = df['Airline'].str.replace('[\d\W]',' ')
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris       10045.0      [23, 47]               KLM
1    Madrid      Milan       10055.0            []     Air France
2    London  Stockholm       10065.0  [24, 43, 87]   British Airways
3  Budapest      Paris       10075.0          [13]           Air France
4  Brussels     London       10085.0      [67, 32]           Swiss Air

# Exercise 4.1: Column Splitting

Given the unemployment data in `data/country_total.csv`, split the `month` column into two new columns: a `year` column and a `month` column, both integers

In [934]:
df = pd.read_csv('data/country_total.csv')
df['month'] = df['month'].astype(str)
df[['year','month']] = df.month.str.split(".",expand=True).astype(int)
df

      country seasonality  month  unemployment  unemployment_rate  year
0          at         nsa      1        171000                4.5  1993
1          at         nsa      2        175000                4.6  1993
2          at         nsa      3        166000                4.4  1993
3          at         nsa      4        157000                4.1  1993
4          at         nsa      5        147000                3.9  1993
...       ...         ...    ...           ...                ...   ...
20791      uk       trend      6       2429000                7.7  2010
20792      uk       trend      7       2422000                7.7  2010
20793      uk       trend      8       2429000                7.7  2010
20794      uk       trend      9       2447000                7.8  2010
20795      uk       trend      1       2455000                7.8  2010

[20796 rows x 6 columns]

In [936]:
df.dtypes #Check that it is int or not

country               object
seasonality           object
month                  int64
unemployment           int64
unemployment_rate    float64
year                   int64
dtype: object

# 4.2 Group Statistics

Given the unemployment data in `data/country_sex_age.csv`, give the average unemployment rate for:

- Each gender
- Each Age Group
- Both Together

**HINT:** The `seasonality` column makes it such that the data is repeated for each method of calculating unemployment (`nsa`, `trend`, etc.). Can you ignore this and group over it? Or should you take the average for each?

In [1050]:
#By sex
df = pd.read_csv('data/country_sex_age.csv')
df.groupby('sex')['unemployment_rate'].mean() #Need to check if this is right
#Might need to take an average of the 3

sex
f    12.982629
m    11.671026
Name: unemployment_rate, dtype: float64

In [1051]:
#By age group
df.groupby('age_group')['unemployment_rate'].mean()

age_group
y25-74     6.905394
y_lt25    17.774057
Name: unemployment_rate, dtype: float64

In [1052]:
#By sex & age
df.groupby(['sex', 'age_group'])['unemployment_rate'].mean()

sex  age_group
f    y25-74        7.566771
     y_lt25       18.457435
m    y25-74        6.244016
     y_lt25       17.098036
Name: unemployment_rate, dtype: float64

In [1053]:
#By sex, age & seasonality
df.groupby(['sex', 'age_group', 'seasonality'])['unemployment_rate'].mean()
#seasonality does have an impact on results and we should consider it's impact

sex  age_group  seasonality
f    y25-74     nsa             7.539839
                sa              7.579982
                trend           7.579934
     y_lt25     nsa            18.818593
                sa             18.323837
                trend          18.231025
m    y25-74     nsa             6.201653
                sa              6.256909
                trend           6.272703
     y_lt25     nsa            17.215211
                sa             17.067671
                trend          17.013327
Name: unemployment_rate, dtype: float64

# 4.3 Estimating group size

Given that we have the unemployment **rate** as a % of total population, and the number of total unemployed, we can estimate the total population.

Give an estimate of the total population for men and women in each age group.

Does this change depending on the unemployment seasonality calculation method?

In [1054]:
df['total_population'] = (df['unemployment'] * 100)/(df['unemployment_rate'])
df.groupby(['sex', 'age_group'])['total_population'].mean()

sex  age_group
f    y25-74       3.220602e+06
     y_lt25       5.665826e+05
m    y25-74       4.357668e+06
     y_lt25       6.679826e+05
Name: total_population, dtype: float64

In [1055]:
df.groupby('seasonality')['total_population'].mean()
#Seasonality impacts unemployment level calculations and will impact our population estimates

seasonality
nsa      2.069865e+06
sa       2.298884e+06
trend    2.251533e+06
Name: total_population, dtype: float64

# 5.1 Tennis

In `data/tennis.csv` you have games that Roger Federer played against various opponents. Questions:

1. How many games did Federer win?

2. What is Federer's win/loss ratio?

3. Who were Federer's top 5 opponents?

In [86]:
df = pd.read_csv('data/tennis.csv')
pd.set_option('display.max_columns', None)
df.sample(4)

,year,tournament,start date,type,surface,draw,atp points,atp ranking,tournament prize money,round,opponent,ranking,score,stats link,tournament.1,tournament round,time,winner,player1 name,player1 nationality,player1 aces,player1 double faults,player1 1st serves in,player1 1st serves total,player1 1st serve points won,player1 1st serve points total,player1 2nd serve points won,player1 2nd serve points total,player1 break points won,player1 break points total,player1 service games played,player1 1st serve return points won,player1 1st serve return points total,player1 2nd serve return points won,player1 2nd serve return points total,player1 break points converted won,player1 break points converted total,player1 return games played,player1 total service points won,player1 total service points total,player1 total return points won,player1 total return points total,player1 total points won,player1 total points total,player2 name,player2 nationality,player2 aces,player2 double faults,player2 1st serves in,player2 1st serves total,player2 1st serve points won,player2 1st serve points total,player2 2nd serve points won,player2 2nd serve points total,player2 break points won,player2 break points total,player2 service games played,player2 1st serve return points won,player2 1st serve return points total,player2 2nd serve return points won,player2 2nd serve return points total,player2 break points converted won,player2 break points converted total,player2 return games played,player2 total service points won,player2 total service points total,player2 total return points won,player2 total return points total,player2 total points won,player2 total points total,win
637,2006,"Dubai, U.A.E.",2006-02-27,CS,Outdoor: Hard,Draw: 32,210,1.0,"$98,600",Q,Robin Vik (CZE),75,"W 6-3, 6-2",http://www.atpworldtour.com/Share/Match-Facts-...,Dubai,Q,58,Roger Federer,Roger Federer,Switzerland,8.0,1.0,40.0,56.0,31.0,40.0,8.0,16.0,5.0,6.0,9.0,9.0,27.0,11.0,17.0,4.0,6.0,8.0,39.0,56.0,20.0,44.0,59.0,100.0,Robin Vik,Czech Republic,2.0,2.0,27.0,44.0,18.0,27.0,6.0,17.0,2.0,6.0,8.0,9.0,40.0,8.0,16.0,1.0,6.0,9.0,24.0,44.0,17.0,56.0,41.0,100.0,True
1032,2011,"SUI vs. POR EAG 1 2nd RD, Switzerland",2011-07-08,DC,Indoor: Hard,Draw: 4,NaN,3.0,$,RR,Rui Machado (POR),93,"W 5-7, 6-3, 6-4, 6-2",http://www.atpworldtour.com/Share/Match-Facts-...,SUI vs. POR EAG 1 2nd RD,RR,0,Roger Federer,Roger Federer,Switzerland,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Rui Machado,Portugal,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,True
1051,2011,"ATP World Tour Masters 1000 Madrid, Spain",2011-05-01,1000,Outdoor: Clay,Draw: 56,360,3.0,"133,000",Q,Robin Soderling (SWE),5,"W 7-6(2), 6-4",http://www.atpworldtour.com/Share/Match-Facts-...,ATP World Tour Masters 1000 Madrid,Q,103,Roger Federer,Roger Federer,Switzerland,8.0,2.0,44.0,73.0,34.0,44.0,19.0,29.0,2.0,2.0,11.0,9.0,41.0,18.0,36.0,1.0,6.0,11.0,53.0,73.0,27.0,77.0,80.0,150.0,Robin Soderling,Sweden,8.0,5.0,41.0,77.0,32.0,41.0,18.0,36.0,5.0,6.0,11.0,10.0,44.0,10.0,29.0,0.0,2.0,11.0,50.0,77.0,20.0,73.0,70.0,150.0,True
983,2010,"ATP World Tour Masters 1000 Miami, FL, U.S.A.",2010-03-24,1000,Outdoor: Hard,Draw: 96,90,1.0,"$39,800",R128,Bye,NaN,W,http://www.atpworldtour.com/Share/Match-Facts-...,ATP World Tour Masters 1000 Miami,R128,0,Roger Federer,Roger Federer,Switzerland,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,N/A Bye,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,True

In [87]:
True + True

2

In [88]:
#df.win returns series of bools.
#since True + True = 2, can .sum() to get sum of Roger's wins

In [89]:
#1.How many games did Federer win?
roger_win = df.win.sum()
print(f"Roger Federer had {roger_win} wins")

Roger Federer had 972 wins

In [90]:
#2.What is Federer's win/loss ratio?
win_loss_ratio = np.round(len(df[df['win'] == True]) / len(df[df['win'] != True]),3)
print(f"Roger Federer has a win-loss ratio of: {win_loss_ratio}")

Roger Federer has a win-loss ratio of: 4.696

In [91]:
#2.1 (alternative way since the whold df is about Roger Federer)
np.round(df.win.sum() / sum(df.win==False), 4)

4.6957

In [92]:
#3. Who were Federer's top 5 opponents?
top_5 = df[df.win==False].groupby('opponent').win.count().sort_values(ascending=False).head(5).index.tolist()
print(f"The top 5 opponents are: {', '.join(top_5)}")

#Filter out Roger's wins, groupby opponents, count each of their wins and look at the ones that 
# won the most games against him by sorting in decreasing order and pulling out the 5 top ones

The top 5 opponents are: Rafael Nadal (ESP), Novak Djokovic (SRB), Andy Murray (GBR), Lleyton Hewitt (AUS), David Nalbandian (ARG)

In [93]:
df[df.win==False].groupby('opponent').win.count().sort_values(ascending=False).head(5)

opponent
Rafael Nadal (ESP)        18
Novak Djokovic (SRB)      13
Andy Murray (GBR)         10
Lleyton Hewitt (AUS)       8
David Nalbandian (ARG)     8
Name: win, dtype: int64

# 5.2 Over time

1. What was Federer's best year? In terms of money, and then in terms of number of wins

2. Did Federer get better or worse over time?

# Answers:

1.What was Federer's best year? In terms of money, and then in terms of number of wins

2.Did Federer get better or worse over time?

1. In terms of money, his best year was 2007, in terms of win it was 2006. 
2. Money-wise, he peaked in 2007 then money went down. In terms of wins, he peaked in 2006 then got a bit worse and slightly gained more wins after that but not near his peak.

In [100]:
type(df['tournament prize money'][0])

str

In [108]:
#In terms of money: 2007

#Remove any other symboles than number-need to comment out because once done, raises error
#df['tournament prize money'] = df['tournament prize money'].str.replace('[^0-9]','')

#convert the string number into a float
df['tournament prize money'] = df['tournament prize money'].replace('[a-zA-Z\$,]', '',
                                                                    regex=True).replace('',0).astype(float)

#need to make sure he won the tournament and got the money
yearly_money = df[df['win']==True].groupby('year')['tournament prize money'].sum().idxmax()

print(f"Federer's best year in terms of money is {yearly_money}")

Federer's best year in terms of money is 2007

In [109]:
#Best year in terms of win: 2006
win_series = df[df['win'] == True].groupby('year')['win'].count().idxmax()
print(f"Federer's best year in terms of money is {win_series}")

Federer's best year in terms of money is 2006

# 5.3 Total money won

In the data, you'll find the `tournament round`, one value of which, `F` indicates the final.

Assuming Federer wins the money in the `tournament prize money` if he wins a final in a tournament, how much money has Federer made in tournaments in this dataset?

In [110]:
df['tournament round'].unique()

array(['R32', 'R16', 'Q', 'S', 'F', 'R64', 'RR', 'R128', 'OB'],
      dtype=object)

In [111]:
tournament_cash = float(df[(df['win']==True) & (df['tournament round']=='F')]['tournament prize money'].sum())
### Wrap each condition in tuple-form ### + ### Use the | or & operator ###
print(f'Federer would have made a total of {tournament_cash}0$ in tournament gains')

Federer would have made a total of 44934964.00$ in tournament gains